tap "homebrew/bundle"

# Development Tools
brew "git"
brew "gh"                # GitHub CLI
brew "node"
brew "yarn"
brew "python@3.13"
brew "go"
brew "ruby"
brew "poetry"
brew "uv"                # Fast Python package installer
brew "zig@0.14"

# DevOps & Cloud
brew "docker"
brew "docker-completion"
brew "supabase"
brew "granted"           # AWS credential helper

# Shell
brew "fish"             

# CLI Tools
brew "fzf"               # Fuzzy finder
brew "glow"              # Markdown renderer
brew "tldr"              
brew "pandoc"            # Document converter
brew "go-task"           # Task runner
brew "yt-dlp"            # Video downloader
brew "trash"             
brew "postgresql@17"

brew "ffmpeg"
brew "cocoapods"


cask "1password"
cask "arc"
cask "claude"
cask "cursor"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "figma"
cask "iterm2"
cask "loom"
cask "microsoft-word"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "pgadmin4"
cask "raycast"
cask "slack"
cask "spotify"
cask "todoist"
cask "xcode"

# Not available via Homebrew:
# ChatGPT
# Cold Turkey Blocker
# Wispr Flow
# TextExpander
