# Brewfile - Homebrew package list
# Install all packages with: brew bundle

# Taps
tap "homebrew/bundle"

# Development Tools
brew "git"
brew "gh"                # GitHub CLI
brew "node"
brew "yarn"
brew "python@3.13"
brew "go"
brew "ruby"
brew "poetry"
brew "uv"                # Fast Python package installer
brew "zig@0.14"

# DevOps & Cloud
brew "docker"
brew "docker-completion"
brew "supabase"
brew "granted"           # AWS credential helper

# Shell
brew "fish"              # Friendly interactive shell

# CLI Tools
brew "fzf"               # Fuzzy finder
brew "glow"              # Markdown renderer
brew "tldr"              # Simplified man pages
brew "pandoc"            # Document converter
brew "go-task"           # Task runner
brew "yt-dlp"            # Video downloader
brew "trash"             # Safe file deletion (moves to Trash)

# Databases
brew "postgresql@17"

# Build Tools
brew "ffmpeg"
brew "cocoapods"

# Cask Applications
# Add GUI apps you use, for example:
# cask "visual-studio-code"
# cask "iterm2"
# cask "slack"
# cask "chrome"
