brew "ffmpeg"
brew "fish"
brew "git"
brew "git-lfs"
brew "node"
brew "starship"

cask "anki"
cask "chatgpt"
cask "clawdbot"
cask "claude"
cask "cursor"
cask "discord"
cask "docker"
cask "figma"
cask "iterm2"
cask "notion-calendar"
cask "obsidian"
cask "raycast"
cask "reader"
cask "slack"
cask "spotify"
cask "textexpander"

# Not available via Homebrew:
# Cold Turkey Blocker
# Onigiri
# Wispr Flow
# Xcode (install via App Store)
